In [1]:
import pandas as pd

In [12]:
df = pd.read_csv("lib/국영수2.csv", encoding = 'cp949')
df

     국어  영어    수학 체육
0  50.0  88  21.0  상
1  41.0  87  54.0  중
2  85.0  65  84.0  상
3  61.0  85  13.0  중
4  54.0  41  21.0  하
5  84.0  47  87.0  하
6  77.0  98  65.0  상
7  87.0  58   NaN  중
8   NaN  22  78.0  하

# df 정보확인
print(f'차원: {df.shape},\n변수: {df.columns},\n타입: {df.dtypes}\n요약:{df.describe()},\nhead:{df.head()},\ntail:{df.tail()}')

In [4]:
# 결측값 확인
df.isnull().sum()

국어    1
영어    0
수학    1
체육    0
dtype: int64

In [5]:
# 독립적인 값 확인
df['국어'].unique()

array([50., 41., 85., 61., 54., 84., 77., 87., nan])

In [6]:
df2 = pd.read_csv("lib/국영수.csv", encoding = 'cp949')
df2

   국어  영어  수학 체육
0  50  88  21  상
1  41  87  54  중
2  85  65  84  상
3  61  85  13  중
4  54  41  21  하
5  84  47  87  하
6  77  98  65  상
7  87  58  54  중
8  54  22  78  하

In [7]:
# column 합
df["total"] = df["영어"] + df["수학"]
print(df["total"])

0    109.0
1    141.0
2    149.0
3     98.0
4     62.0
5    134.0
6    163.0
7      NaN
8    100.0
Name: total, dtype: float64

In [8]:
# columns 추출
columns = ['국어', '영어', '수학']
selected_columns = df[columns]
print(selected_columns)

     국어  영어    수학
0  50.0  88  21.0
1  41.0  87  54.0
2  85.0  65  84.0
3  61.0  85  13.0
4  54.0  41  21.0
5  84.0  47  87.0
6  77.0  98  65.0
7  87.0  58   NaN
8   NaN  22  78.0

In [9]:
df["체육"][:4]

0    상
1    중
2    상
3    중
Name: 체육, dtype: object

<hr>
5/12

In [13]:
df1 = df.drop(['체육'], axis = 1) # axis = 0 -> 행을 삭제, 1 -> 열을 삭제
df2 = df1.drop(['영어', '수학'], axis = 1)
df2

     국어
0  50.0
1  41.0
2  85.0
3  61.0
4  54.0
5  84.0
6  77.0
7  87.0
8   NaN

In [20]:
data = {
    'A': [1, 2, 3, 4],
    'B': [4.1, 3.5, 2.1, 5.7],
    'C': ['one', 'two', 'three', 'four']
}

df = pd.DataFrame(data)

df['A'] = df['A'].astype(float)
df['B'] = df['B'].astype(int)
df['A'] = df['A'].astype('str')
df['C'] = df['C'].astype('category')

df.dropna()는 데이터프레임의 불완전한 데이터가 있는 행을 삭제함
df.fillna(채워넣을 값) 기본값을 제공하여 데이터 누락으로 인해 데이터에 대한 작업이 실패하지 않도록 하기 위해 자주 사용됨
```python
df.fillna(df.median()) # 중앙값으로 대체
df.fillna(df.mean()) # 평균값으로 대체
```

In [28]:
df_f = pd.read_csv("lib/국영수2.csv", encoding = 'cp949')
df_f

     국어  영어    수학 체육
0  50.0  88  21.0  상
1  41.0  87  54.0  중
2  85.0  65  84.0  상
3  61.0  85  13.0  중
4  54.0  41  21.0  하
5  84.0  47  87.0  하
6  77.0  98  65.0  상
7  87.0  58   NaN  중
8   NaN  22  78.0  하

```python
위 df_f 파일에서 fillna 함수를 실행해도 적용되지 않음
체육 값은 텍스트로 되어 있기 때문에 평균, 중앙값이 작동하지 않기 때문
채육 값 나머지를 선택해야함
```

In [35]:
A = df_f.select_dtypes(include=["number"]).columns # 수치가 포함되어있는 변수들만 선택
print(df_f[A])

df_f[A].fillna(df_f[A].median())

     국어  영어    수학
0  50.0  88  21.0
1  41.0  87  54.0
2  85.0  65  84.0
3  61.0  85  13.0
4  54.0  41  21.0
5  84.0  47  87.0
6  77.0  98  65.0
7  87.0  58   NaN
8   NaN  22  78.0

     국어  영어    수학
0  50.0  88  21.0
1  41.0  87  54.0
2  85.0  65  84.0
3  61.0  85  13.0
4  54.0  41  21.0
5  84.0  47  87.0
6  77.0  98  65.0
7  87.0  58  59.5
8  69.0  22  78.0

In [43]:
import numpy as np

data = {
    '나이': [22, 35, 14, 55, 42]
}
df = pd.DataFrame(data)

def categorize (data):
    if 0 < data <= 10:
        return "10대"
    elif 10 < data <= 20:
        return "20대"
    elif 20 < data <= 30:
        return "30대"
    else:
        return "30대 이상"

df['검사나이'] = df['나이'].apply(categorize) # apply : 데이터의 행단위로 무언가를 연속으로 진행할 경우

In [47]:
data = {
    'Numeric1': [1, np.nan, 3, 4],
    'Numeric2': [5, 6, np.nan, 8.2],
    'Category': ['dog', np.nan, 'cat', 'dogg']
}
df = pd.DataFrame(data)
filter_df = df[df['Category'] == 'dog']
filter_df_contains = df[df['Category'].str.contains('do', na=False)]
print(filter_df_contains)

   Numeric1  Numeric2 Category
0       1.0       5.0      dog
3       4.0       8.2     dogg

In [50]:
df = pd.DataFrame({
    'variable': ['value1-value2-value3', "value-3-value4-value5", "vvdfvalue165656"]
})

df['new_variable'] = df['variable'].replace({'vvdfvalue165656': 'value1'})

df

                variable           new_variable
0   value1-value2-value3   value1-value2-value3
1  value-3-value4-value5  value-3-value4-value5
2        vvdfvalue165656                 value1

In [52]:
# 특정 문자가 포함되어 있으면 전체를 해당 문자로 변경(전체에서 찾음)
df["new_variable"] = df['variable'].str.extract(r'(value1)')
print(df["new_variable"])

df["new_variable"] = df['variable'].str.extract(r'(value2)')
print(df["new_variable"])

0    value1
1       NaN
2    value1
Name: new_variable, dtype: object
0    value2
1       NaN
2       NaN
Name: new_variable, dtype: object

In [65]:
df = pd.DataFrame({
    'variable': ['value1-value2-value3', "value4-value5", "value6"]
})

spilt_df = df['variable'].str.split('-', expand = True)
# expand -> 나눠서 각각 데이터프레임을 생성하도록 만드는 옵션

spilt_df.columns = ['var1', 'var2', 'var3']

df

               variable
0  value1-value2-value3
1         value4-value5
2                value6

In [66]:
df = pd.DataFrame({
    'variable': ['value1-value2-value3', "value4-value5", "value6"]
})

df['variable'] = df['variable'].str[0:5] # 해당 위치에 포함되는 문자를 추출함
df['variable'] = df['variable'].str[0:5] + df['variable'].str[6:12]
df

  variable
0    value
1    value
2    value

In [ ]:
df = pd.DataFrame({
    'variable': ['value1-value2-value3', "value4-value5", "value6"]
})

df['var1'] = df['var1'].astype(str)
df['var2'] = df['var2'].astype(str)
df['var3'] = df['var3'].astype(str)
df['combined'] = df['var1'] + '-' + df['var2'] + '-' + df['var3']